
//                                                Домашние задание.
//                                                 Урок 4 (Лист №1).
public class main1 {
public static void main(String[] args) {

        // 1. Создать 5 целочисленных переменных. Имя первых двух выберите сами. Имя третьей, четвертой и пятой переменной будет
        // состоять из двух слов (например, cat count).

        int Dom = 123;
        int machina = 3;
        int catCount = 585;
        int DogCount = 38;
        int FlyCount = 789;

        // 2. Создать строковую переменную.

        String map = "НАДПИСЬ";

        // 3. Создать две символьных переменных.

        char g = 'F';
        char gh = 'd';

        // 4. Создать переменную типа Integer и присвоить ей значение 10.

        int i = 10;

        // 5. Создать переменную с плавающей точкой.

        double a = 10;

        // 6. Вывести значения всех этих переменных на консоль, используя имена переменных. (распечатать).

        System.out.println(Dom);
        System.out.println(machina);
        System.out.println(catCount);
        System.out.println(FlyCount);
        System.out.println(map);
        System.out.println(g);
        System.out.println(gh);
        System.out.println(i);
        System.out.println(a);
    }
}